ka2_2024/src/Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/ВидыЗастрахованныхЛицОбязательногоСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗастрахованныхЛицОбязательногоСтрахования</name>
  <enumValues>
    <name>ГражданеРФ</name>
  </enumValues>
  <enumValues>
    <name>ПостоянноПроживающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыПостоянноПроживающие</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПроживающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыВременноПроживающие</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыПризнанныеБеженцами</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыНестрахуемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыИзЕАЭС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСтрахуемыеФСС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыНестрахуемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСтрахуемыеНаОПС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	БезПроизводныхЗначений = Неопределено;
	Параметры.Свойство("БезПроизводныхЗначений", БезПроизводныхЗначений);
	
	Если БезПроизводныхЗначений = Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ, НСтр("ru = 'Гражданин Российской Федерации'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, подлежащий страхованию кроме высококвалифицированных иностранных специалистов'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами, НСтр("ru = 'Иностранец, которому предоставлено временное убежище, временно пребывающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы, НСтр("ru = 'Приравнен к гражданам РФ (постоянно проживает, признан беженцем, гражданин страны-участника Договора о ЕАЭС)'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию кроме высококвалифицированных иностранных специалистов'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы, НСтр("ru = 'Иностранец, временно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, постоянно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно проживающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи из страны-участника Договора о ЕАЭС, временно пребывающий на территории РФ'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыНестрахуемые, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно пребывающий на территории РФ, не подлежащий страхованию'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, с 2023 года не подлежащий страхованию на ОПС в соответствии с международным договором'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеНаОПС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, подлежащий страхованию только на ОПС в соответствии с международным договором'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды застрахованных лиц, которые относятся к высококвалифицированным специалистам.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//
Функция ВысококвалифицированныеСпециалисты() Экспорт
	
	Категории = Новый Массив;
	Категории.Добавить(ВысококвалифицированныеСпециалистыВременноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыИзЕАЭС);
	Категории.Добавить(ВысококвалифицированныеСпециалистыНестрахуемые);
	
	Возврат Категории;
	
КонецФункции

// Возвращает виды застрахованных лиц, которые являются валютными резидентами.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//
Функция ВалютныеРезиденты() Экспорт
	
	ВалютныеРезиденты = Новый Массив;
	ВалютныеРезиденты.Добавить(ГражданеРФ);
	ВалютныеРезиденты.Добавить(ПостоянноПроживающиеИностранцы);
	ВалютныеРезиденты.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	
	Возврат ВалютныеРезиденты;
	
КонецФункции


#КонецОбласти

#КонецЕсли
